brianreinhold/NordicPHDs/nRF51/ble_app_met_epoch/main.c
#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2        /**< Reply when unsupported features are requested. */

// Colors only valid on the nRF52840 dongle. On the DK there are four different LEDs all of which are yellow.
// LED_0 is the other LED which is green-yellow
// LED_1 is red
// LED_2 is green
// LED_3 is blue

#define ADVERTISING_LED                 BSP_BOARD_LED_2                         /**< Is on when device is advertising. */ 
#define ERROR_LED                       BSP_BOARD_LED_1
#define CONNECTED_LED                   BSP_BOARD_LED_3                         /**< Is on when device has connected.*/
#define MSMT_DATA_LED                  (BSP_BOARD_LED_3 | BSP_BOARD_LED_1)      /**< Flashes pink when Keiser data is received and queued. */
#define DISCONNECTED_LED                BSP_BOARD_LED_0

static unsigned long elapsedTimeStart;

static unsigned short mtu_size                                  = GATT_MTU_SIZE_DEFAULT;
static unsigned short data_length                               = 27;  // Max size of advertisement?
static bool flash_write_needed                                  = true;

APP_TIMER_DEF(m_met_disconnect_timer_id);      /**< disconnect handler */
APP_TIMER_DEF(m_met_live_data_timer_id);
APP_TIMER_DEF(m_met_flash_write_timer_id);
APP_TIMER_DEF(m_app_dummy_timer_id);

static bool                     stored_data_done_sent;

static uint16_t                 m_connection_handle             = BLE_CONN_HANDLE_INVALID;     /**< Handle of the current connection. */
static uint16_t                 m_met_service_handle            = BLE_GATT_HANDLE_INVALID;
static ble_gatts_char_handles_t m_met_cp_handle;
static ble_gatts_char_handles_t m_met_response_handle;
static unsigned char            cccdSet[2]                      = {0, 0};
static unsigned short           noOfCccds                       = 2;
static bool                     hasEncrypted                    = false;
static bool                     send_live_data                  = false;
static unsigned long            live_data_count                 = 0;
static unsigned short           timeSync                        = 0x1F00;       // Unsynchronized
static volatile bool            met_abort                       = false;
static ble_gap_sec_params_t     own_sec_params;
static ble_gap_sec_params_t     peer_sec_params;
static ble_gap_sec_keyset_t     keys;
static uint16_t                 saveDataLength                  = 0;
static uint8_t                  *saveDataBuffer                 = NULL;
static volatile bool            restartAdv                      = false;
ble_gap_conn_params_t           gap_conn_params;
nrf_mutex_t p_mutex;
nrf_mutex_t q_mutex;
//static __align(4) uint32_t evt_buf[CEIL_DIV(BLE_STACK_EVT_MSG_BUF_SIZE, sizeof(uint32_t))];
__ALIGN(4) uint8_t *evt_buf;
__ALIGN(4) uint8_t *evt_buf2;

static uint8_t cpResponse[6];

//=========================== PARAMETERS FOR MET DATA
s_Queue *queue;

/*
 This MET sends indications on two characteristics. These variables tell the indicate data method
 which handles (characteristics) to send indications on.
 When the PHD receives a command, the MET will do one of two things:
    1. indicate a response on the control point characteristic indicating the command has been handled.
       The PHG may send the next command.
    2. indicate a one or more responses on the response characteristic (the response may be fragmented over
       several indications, such as the systemInfo and the measurement groups)
       then indicate a response on the control point characteristic - usually this means the PHD is done
       handling the command, but it may also indicate a measurement group has been completed but more are
       to come. In that case the PHG just handles the measurement group and waits for more. It shall NOT
       send another command. The PHD will send a final response indicating the measurement groups are completed,
       ending the command. Now the PHG may send the next command.
       
       In the live data situation, the command never completes. The PHD will just send measurement groups
       on the response characteristic followed by group finished response on the control point and then
       continue with the next. When the PHD has no more data to send it disconnects. 
 */

volatile s_global_send global_send;
static volatile bool send_flag = false;

extern unsigned short pairing;          // Value of 1 indicates that pairing/bonding is required.
extern unsigned char batteryCharValue;
extern s_SystemInfo *systemInfo;
extern char *DEVICE_NAME;
extern unsigned short SPECIALIZATION;
extern unsigned short BLE_APPEARANCE;

// ------------- Current time and time info

static unsigned char cont_response[] = 
{
    (COMMAND_SEND_LIVE_DATA & 0xFF),
    ((COMMAND_SEND_LIVE_DATA >> 8) & 0xFF),         // Place for the command which will always be transfer live data
    0x00, ((HEADER_FLAGS_OPTIMIZED_RECORD_DONE >> 8) & 0xFF),// flags (no time stamp) subsequent message done
    0x01, 0x00,                                     // total length of the measurement group (123 - 6)
    0x01                                            // group id
};

unsigned long prevCount = 0;
static unsigned long long cycles = 0;
unsigned long long accumulatedCycleCount = 0;
unsigned long long getRtcCount()  // Returns the number of elapsed ticks where 32768 ticks is one second
{
    unsigned long  count = app_timer_cnt_get();
    if (count < prevCount)
    {
        cycles++;
        accumulatedCycleCount = accumulatedCycleCount + (unsigned long long)(MAX_RTC_COUNTER_VAL);
        NRF_LOG_DEBUG("Time cycled. Cycles %u  accumulatedCycleCount %u\r\n", cycles, accumulatedCycleCount);
    }
    prevCount = count;
    return (unsigned long long)count + accumulatedCycleCount;
}

/*
 * Clock has 32768 ticks per second
 * 1 tick = 30.517578125 microseconds
 *          .030517578125 milliseconds
 *          .000030517578 seconds
 *  seconds = (ticks + 16384) /32768
 *  10ths of milliseconds = (ticks + 1.6384) / 3.2768
 *  milliseconds = (ticks + 16.384) / 32.768
 * or
 *  xth seconds = (FACTOR * ticks + 16384) / 32768  (this gives rounds when using integer divides)
       where FACTOR = 1 for seconds, 10 for tenths, 100 for hundredths, and 1000 for milliseconds
 */
static unsigned long long getRtcTicks()
{
    unsigned long long count = getRtcCount() - elapsedTimeStart;
    return ((count * factor + 16384) / 32768);
}

