brianreinhold/NordicPHDs/nRF51/ble_app_met_epoch/main.c
static unsigned long getTicks()
{
    unsigned long long count = getRtcCount() - elapsedTimeStart;
    return (unsigned long)((count * 1000 + 16384) / 32768);
}

static void sec_params_init(void)
{
    own_sec_params.bond            = SEC_PARAM_BOND;
    own_sec_params.mitm            = SEC_PARAM_MITM;
    own_sec_params.io_caps         = SEC_PARAM_IO_CAPABILITIES;
    own_sec_params.oob             = SEC_PARAM_OOB;
    own_sec_params.min_key_size    = SEC_PARAM_MIN_KEY_SIZE;
    own_sec_params.max_key_size    = SEC_PARAM_MAX_KEY_SIZE;
    own_sec_params.kdist_peer.enc  = 1;     // peer to send their encryption key;
    own_sec_params.kdist_peer.id   = 1;     // peer to send its IRK
    own_sec_params.kdist_peer.link = 0;     // peer to derive link key from LTK - This must be 0 or you will get an NRF_ERROR_NOT_SUPPORTED error
    own_sec_params.kdist_peer.sign = 0;     // peer to send signature resolving key - This must be 0 or you will get an NRF_ERROR_NOT_SUPPORTED error
    own_sec_params.kdist_own.enc   = 1;     // We distribute our LTK
    own_sec_params.kdist_own.id    = 1;     // We distribute our IRK (even though we don't use resolvable random addressing
    own_sec_params.kdist_own.link  = 0;     // we are to derive link key from LTK - This must be 0 or you will get an NRF_ERROR_NOT_SUPPORTED error
    own_sec_params.kdist_own.sign  = 0;     // We to send signature resolving key - This must be 0 or you will get an NRF_ERROR_NOT_SUPPORTED error
}

#define ADVERTISING_INTERVAL_40_MS 64  /**< 0.625 ms = 40 ms */
#define BUFFER_SIZE 30
static ble_gap_adv_params_t     m_adv_params;
static uint8_t  data_buffer[BUFFER_SIZE];
static uint8_t  scan_rsp_buffer[BUFFER_SIZE];
uint32_t advertisement_met_set(void)
{
    uint32_t error_code;
    uint8_t  index = 0;
    uint8_t  scan_index = 0;
    char printBuf[256];
    memset(printBuf, 0, 256);
    memset(data_buffer, 0, sizeof(data_buffer));
    memset(scan_rsp_buffer, 0, sizeof(scan_rsp_buffer));

    const uint8_t name_length = (uint8_t)strlen(DEVICE_NAME);

    // Set the flags - important to indicate no EDR/BR support for some Androids
    // Actually by spec one is SUPPOSED to set one of the discoverable flags to be discoverable.
    data_buffer[index++] = 2;        // length of flags data type
    data_buffer[index++] = BLE_GAP_AD_TYPE_FLAGS;
    data_buffer[index++] = BLE_GAP_ADV_FLAG_LE_GENERAL_DISC_MODE | BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;    // No EDR/BR support and general discoverable

    scan_rsp_buffer[scan_index++] = 3;        // length of appearance data type
    scan_rsp_buffer[scan_index++] = BLE_GAP_AD_TYPE_APPEARANCE;
    scan_rsp_buffer[scan_index++] = (BLE_APPEARANCE & 0xFF);
    scan_rsp_buffer[scan_index++] = ((BLE_APPEARANCE >> 8) & 0xFF);

    // Set the device name.
    if (DEVICE_NAME != NULL)
    {
        scan_rsp_buffer[scan_index++] = name_length + 1; // Device name + data type
        scan_rsp_buffer[scan_index++] = BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME;
        memcpy((char*)&scan_rsp_buffer[scan_index++], DEVICE_NAME, name_length);  // destination, source, length
        scan_index += name_length;
    }

    // Set the device's service.
    data_buffer[index++] = 1 + 2;
    data_buffer[index++] = BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_COMPLETE;
    // Store in little-endian format.
    data_buffer[index++] = BTLE_MET_SERVICE & 0xFF;
    data_buffer[index++] = (BTLE_MET_SERVICE & 0xFF00) >> 8;
    // Add the Service Data for the specializations
    data_buffer[index++] = 1 + 2 + 1 + 2 * 1 + 1; // numberOfSpecializations + pairing option;
    data_buffer[index++] = BLE_GAP_AD_TYPE_SERVICE_DATA;
    // Store in little-endian format.
    data_buffer[index++] = BTLE_MET_SERVICE & 0xFF;
    data_buffer[index++] = (BTLE_MET_SERVICE & 0xFF00) >> 8;

    data_buffer[index++] = 1;

    data_buffer[index++] = (SPECIALIZATION & 0xFF);
    data_buffer[index++] = ((SPECIALIZATION >> 8) & 0xFF);
    data_buffer[index++] = (unsigned char)pairing;        // Support pairing

    // Used in start advertising:
    memset(&m_adv_params, 0, sizeof(ble_gap_adv_params_t));
    m_adv_params.channel_mask.ch_37_off = 0;
    m_adv_params.channel_mask.ch_38_off = 0;
    m_adv_params.channel_mask.ch_39_off = 0;
    m_adv_params.type = BLE_GAP_ADV_TYPE_ADV_IND;   // general connectable scannable
    m_adv_params.fp = BLE_GAP_ADV_FP_ANY;           // Any one can scan and connect
    m_adv_params.interval = ADVERTISING_INTERVAL_40_MS;
    m_adv_params.timeout = BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED;


    memset(printBuf, 0, 256);
    NRF_LOG_INFO("Advertisement is %s\r\n", (uint32_t)byteToHex(data_buffer, printBuf, " ", index));
    NRF_LOG_FLUSH();
    if (scan_index > 0)
    {
        memset(printBuf, 0, 256);
        NRF_LOG_INFO("Scan response is: %s\r\n", (uint32_t)byteToHex(scan_rsp_buffer, printBuf, " ", scan_index));
        NRF_LOG_FLUSH();
    }

    // s130 way to set data
    error_code = sd_ble_gap_adv_data_set(data_buffer, index, scan_rsp_buffer, scan_index);

    if (error_code != NRF_SUCCESS)
    {
        if (error_code == 10)
        {
            NRF_LOG_DEBUG("Failed to set advertisement data. Error code: invalid flags\r\n");
        }
        else
        {
            NRF_LOG_DEBUG("Failed to set advertisement data. Error code: 0x%02X\r\n", error_code);
        }
        return error_code;
    }
    return NRF_SUCCESS;
}

static uint32_t advertising_start()
{
    uint32_t             error_code;

    error_code = sd_ble_gap_adv_start(&m_adv_params);

    if (error_code != NRF_SUCCESS)
    {
        NRF_LOG_DEBUG("Failed to start advertising. Error code: 0x%02X\r\n", error_code);
        return error_code;
    }

    NRF_LOG_DEBUG("Started advertising at time %u\r\n", getTicks());
    return NRF_SUCCESS;
}

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

void ble_disconnected_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    uint32_t  err_code;
    
    if (m_connection_handle != BLE_CONN_HANDLE_INVALID)
    {
        met_abort = true;
        err_code = sd_ble_gap_disconnect(m_connection_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
    }
}

