brianreinhold/NordicPHDs/nRF51/ble_app_met_epoch/main.c
void dummy(void * p_context)
{
    UNUSED_PARAMETER(p_context);
}

static void command_handler(void * p_context);
static void write_flash(void * p_context);
static void live_data_handler(void * p_context);
static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module, making it use the scheduler.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

    err_code = app_timer_create(&m_met_disconnect_timer_id,
                            APP_TIMER_MODE_SINGLE_SHOT,
                            ble_disconnected_handler);

    err_code = app_timer_create(&m_met_flash_write_timer_id,
                            APP_TIMER_MODE_SINGLE_SHOT,
                            write_flash);
    err_code = app_timer_create(&m_met_live_data_timer_id,
                            APP_TIMER_MODE_REPEATED,
                            live_data_handler);
    err_code = app_timer_create(&m_app_dummy_timer_id,
                            APP_TIMER_MODE_REPEATED,
                            (void *)getRtcCount);
    APP_ERROR_CHECK(err_code);

}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_connection_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static uint32_t conn_params_init(void)
{
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = &gap_conn_params;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    // Set the connection params in stack
    return sd_ble_gap_ppcp_set(cp_init.p_conn_params);
}


/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
/*
static void sleep_mode_enter(void)
{
    uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);

    APP_ERROR_CHECK(err_code);

    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}
*/
#if (USES_TIMESTAMP == 1)
static void getCurrentTime()
{
    char buffer[64];
    updateCurrentTimeEpoch(&sTimeInfoData, getRtcTicks() + epoch);
    memset(buffer, 0, 64);
    NRF_LOG_INFO("Getting the current time info: %s\r\n", (uint32_t)byteToHex(sTimeInfoData->timeInfoBuf, buffer, " ", sTimeInfoData->dataLength));
    NRF_LOG_FLUSH();
    NRF_LOG_DEBUG("Current Epoch time %llu\r\n", (getRtcTicks() + epoch));
}
#endif


/**@brief Function for handling the Application's BLE Stack events.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static bool on_generic_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t err_code = NRF_SUCCESS;

    switch (p_ble_evt->header.evt_id)
    {
        // MET - Should never happen
        case BLE_EVT_USER_MEM_REQUEST:
            err_code = sd_ble_user_mem_reply(m_connection_handle, NULL);
            APP_ERROR_CHECK(err_code);
            break; // BLE_EVT_USER_MEM_REQUEST

        // GHS - Should never happen
        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
        {
            ble_gatts_evt_rw_authorize_request_t  req;
            ble_gatts_rw_authorize_reply_params_t auth_reply;

            req = p_ble_evt->evt.gatts_evt.params.authorize_request;

            if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID)
            {
                if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL))
                {
                    if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                    }
                    else
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
                    }
                    auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
                    err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                               &auth_reply);
                    APP_ERROR_CHECK(err_code);
                }
            }
        } 
        break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST

        default:
            // No implementation needed.
            return false;
    }
    return true;
}

#if (NRF_SD_BLE_API_VERSION == 3)
static bool handleCommonEvents(ble_evt_t* p_ble_evt, uint16_t mtu_size)
{
    uint32_t err_code;
    bool used = false;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
            err_code = sd_ble_gatts_exchange_mtu_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                mtu_size);

            if (err_code != NRF_SUCCESS)
            {
                //NRF_LOG_DEBUG("MTU exchange request reply failed. Error code: 0x%02X\r\n", err_code);
            }
            used = true;
            break;

        case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:
        {
            //NRF_LOG_DEBUG("Data length update request: max_rx_octets %d, max_rx_time %d, \r\n"
            //    "max_tx_octets %d, max_tx_time %d\r\n",
            //    p_ble_evt->evt.gap_evt.params.data_length_update_request.peer_params.max_rx_octets,
            //    p_ble_evt->evt.gap_evt.params.data_length_update_request.peer_params.max_rx_time_us,
            //    p_ble_evt->evt.gap_evt.params.data_length_update_request.peer_params.max_tx_octets,
            //    p_ble_evt->evt.gap_evt.params.data_length_update_request.peer_params.max_tx_time_us);
            uint32_t result = sd_ble_gap_data_length_update(
                p_ble_evt->evt.gap_evt.conn_handle,
                NULL, //&p_ble_evt->evt.gap_evt.params.data_length_update_request.peer_params,
                NULL);
            //NRF_LOG_DEBUG("Result %d\r\n", result);
            used = true;
        }
        break;

        case BLE_GAP_EVT_DATA_LENGTH_UPDATE:
        {
            //NRF_LOG_DEBUG("Data length update: max_rx_octets %d, max_rx_time %d, \r\n"
            //    "max_tx_octets %d, max_tx_time %d\r\n",
            //    p_ble_evt->evt.gap_evt.params.data_length_update.effective_params.max_rx_octets,
            //    p_ble_evt->evt.gap_evt.params.data_length_update.effective_params.max_rx_time_us,
            //    p_ble_evt->evt.gap_evt.params.data_length_update.effective_params.max_tx_octets,
            //    p_ble_evt->evt.gap_evt.params.data_length_update.effective_params.max_tx_time_us);
        }
        used = true;
        break;

