brianreinhold/NordicPHDs/nRF51/ble_app_met_epoch/main.c
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            //NRF_LOG_DEBUG("Physical update request: rx phys %d, tx phys %d\r\n",
            //    p_ble_evt->evt.gap_evt.params.phy_update_request.peer_preferred_phys.rx_phys,
            //    p_ble_evt->evt.gap_evt.params.phy_update_request.peer_preferred_phys.tx_phys);
            const ble_gap_phys_t* phys = &p_ble_evt->evt.gap_evt.params.phy_update_request.peer_preferred_phys;
            uint32_t result = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle,
                phys);
            //NRF_LOG_DEBUG("Result %d\r\n", result);
            used = true;
        }

        case BLE_GAP_EVT_PHY_UPDATE:
        {
            //NRF_LOG_DEBUG("Physical update update:rx phys %d, tx phys %d,\r\n",
            //    p_ble_evt->evt.gap_evt.params.phy_update.rx_phy,
            //    p_ble_evt->evt.gap_evt.params.phy_update.tx_phy);
            used = true;
        }
        break;
    }
    return used;
}
#endif

static void print_send_data(unsigned short length, unsigned char *data)
{
    NRF_LOG_INFO("=====> Sending %u bytes of data at time %u: \r\n", length, getTicks());
    // All this crap is just to print the data being sent in 32-byte chunks
    int j = 0;
    int size = (length > 32) ? 32 : length;
    char buffer[104];
    while (true)
    {
        memset(buffer, 0, 104);
        if ((j + 32) > length)
        {
            size = length - j;
        }
        NRF_LOG_INFO("%s\r\n", (uint32_t)byteToHex(&data[j], buffer, " ", size));
        NRF_LOG_FLUSH();
        j = j + size;
        if (j >= length) break;
    }
}

static uint32_t send_data()
{
    if (global_send.data_length == 0 || !send_flag)   // Nothing to send
    {
        return NRF_SUCCESS;
    }
    uint32_t               error_code;
    uint16_t               hvx_length;
    ble_gatts_hvx_params_t hvx_params;
    if(sd_mutex_acquire(&p_mutex) == NRF_ERROR_SOC_MUTEX_ALREADY_TAKEN)
    {
        NRF_LOG_DEBUG("Mutex locked\r\n");
        return NRF_ERROR_SOC_MUTEX_ALREADY_TAKEN;
    }
    int                    count = 1;   // For Debug informational output only
    if (global_send.offset == 0 && send_flag)
    {
        print_send_data(global_send.data_length, global_send.data);
    }
    send_flag = false;

    while(true)
    {
        if (met_abort // connection has been terminated by PHG
            || (m_connection_handle == BLE_CONN_HANDLE_INVALID))    // the connection has been killed
        {
            NRF_LOG_DEBUG("=====> Aborted or connection handle invalid\r\n");
            emptyQueue(queue);
            error_code = NRF_ERROR_INVALID_STATE;
            break;
        }
        // If amount of data exceeds max size, send chunk sized length of data
        if (global_send.data_length - global_send.offset > global_send.chunk_size) //(GATT_MTU_SIZE_DEFAULT - OPCODE_LENGTH - HANDLE_LENGTH))
        {
            hvx_length = global_send.chunk_size; //(GATT_MTU_SIZE_DEFAULT - OPCODE_LENGTH - HANDLE_LENGTH);
        }
        // If the amount is less than that value set it to the amount left.
        else
        {
            hvx_length = global_send.data_length - global_send.offset;
        }
        NRF_LOG_INFO("=====> Send # %u: Send %u bytes of %u total from offset %u at time %u\r\n",
            count, hvx_length, global_send.data_length, global_send.offset, getTicks());
        count++;

        hvx_params.handle = global_send.handle;
        hvx_params.type = (global_send.handle == m_met_response_handle.value_handle) ? cccdSet[1] : BLE_GATT_HVX_INDICATION;
        hvx_params.offset = 0; // global_send_offset;
        hvx_params.p_len = &hvx_length;
        hvx_params.p_data = (unsigned char *)(global_send.data + global_send.offset);

        // Send indication or notification
        print_send_data(hvx_length, (unsigned char *)hvx_params.p_data); // Prints just the fragment
        error_code = sd_ble_gatts_hvx(m_connection_handle, &hvx_params);
        if (error_code == NRF_SUCCESS)
        {
            // This is for notifications. We need to make sure all notifications are accounted for before indicating that the 
            // record is complete. So it increments here, and decrements in the BLE_EVT_TX_COMPLETE event. The event may
            // contain more than one packet sent.
            global_send.chunks_outstanding++;
            // Update the position in the buffer for the next send
            global_send.offset = global_send.offset + *hvx_params.p_len;
            // If that update exceeds the buffer size, we are done
            if (global_send.offset >= global_send.data_length)
            {
                NRF_LOG_DEBUG("=====> Entire package sent\r\n");
                error_code = NRF_SUCCESS;
                break;
            }
            // If an indication we need to wait for the BLE_GATTS_EVT_HVC before the next send
            if (hvx_params.type == BLE_GATT_HVX_INDICATION)
            {
                error_code = NRF_SUCCESS;
                break; // Wait for event
            }
            // We have more TX buffers so send the next hunk
            //NRF_LOG_DEBUG("=====> TX buffer still available\r\n");
            continue;
        }
        // This will only happen for indications. Here we simply loop on redoing the send calls
        // until the send goes, then we can advance the buffer and wait for the BLE_GATTS_EVT_HVC event.
        else if (error_code == NRF_ERROR_BUSY)  // Indications only
        {
            while (sd_ble_gatts_hvx(m_connection_handle, &hvx_params) == NRF_ERROR_BUSY);  // keep calling until not busy.
            global_send.offset = global_send.offset + *hvx_params.p_len;
            global_send.chunks_outstanding++;
            error_code = NRF_SUCCESS;
            break;    // Wait for event
        }
        // If we have no buffers, we have to wait for the BLE_EVT_TX_COMPLETE event and resend
        else if (error_code == NRF_ERROR_RESOURCES || error_code == BLE_ERROR_NO_TX_PACKETS) // Notifications only
        {
            NRF_LOG_INFO("=====> No TX buffers; wait for event and resend.\r\n");
            //global_send.chunks_outstanding++;
            error_code = NRF_SUCCESS;
            break;
        }
        // Hopefully this does not happen.
        else
        {
            NRF_LOG_DEBUG("=====> Failed doing the indication. Error code: 0x%02X\r\n", error_code);
            global_send.data_length = 0;
            global_send.offset = 0;
            global_send.data = NULL;
            global_send.handle = 0;
            emptyQueue(queue);
            break;
        }
    }
    sd_mutex_release(&p_mutex);
    return error_code;
}

static void createContinuousRecordDone()
{
    global_send.chunks_outstanding = 0;
    global_send.handle = m_met_response_handle.value_handle;
    global_send.data = cont_response;
    global_send.data_length = 7;
    global_send.offset = 0;
    global_send.continuous_stage = CONT_RECORD_DONE;
}

static void createCpResponse(uint16_t error, uint16_t *response)
{
    global_send.chunks_outstanding = 0;
    global_send.handle = m_met_cp_handle.value_handle;
    // Put command into CP response
    cpResponse[0] = (global_send.current_command & 0xFF);
    cpResponse[1] = ((global_send.current_command >> 8) & 0xFF);
    // put result
    cpResponse[2] = (error & 0xFF);
    cpResponse[3] = ((error >> 8) & 0xFF);
    global_send.data_length = 4;
    if (response != NULL)
    {
        NRF_LOG_DEBUG("Response field non NULL: value 0x%u\r\n", *response);
        cpResponse[4] = (*response & 0xFF);
        cpResponse[5] = ((*response >> 8) & 0xFF);
        global_send.data_length = 6;
    }
    global_send.data = cpResponse;
    global_send.offset = 0;
}

bool readyToSend()
{
    return (                                      // If PHG has given the send live data command and
        m_connection_handle != BLE_CONN_HANDLE_INVALID   // the connection is valid and
        && hasEncrypted                                     // encryption has been done
        && cccdSet[1]);                                      // the response characteristic has been enabled
}

/**
  We assume there is some kind of interrupt triggered by the sensor that sends measurement data to this
  module. Those values are loaded into the struct s_MsmtData liveMsmt. Then this method is called to set
  up the global_send parameters.

  Live measurements can only be sent after the PHG has given the command to send live measurements.
 */
bool prepareMeasurements(s_MsmtGroupData *msmtGroupData)
{
    if (readyToSend() && msmtGroupData != NULL)
    {
        global_send.data = msmtGroupData->data;

        // Set up parameters for indication of this PDU - likely in fragments
        global_send.chunks_outstanding = 0;
        global_send.handle = m_met_response_handle.value_handle;
        global_send.offset = 0;
        global_send.data_length = (unsigned short)msmtGroupData->dataLength;
        global_send.continuous_stage = CONT_NONE;
        return true;
    }
    return false;
}

/**
  This 
 */
#if (USES_STORED_DATA == 1)
void sendStoredMeasurements(unsigned short stored_count)
{
    if (m_connection_handle != BLE_CONN_HANDLE_INVALID && cccdSet[1])
    {
        sendStoredSpecializationMsmts(stored_count);
        bsp_board_led_on(MSMT_DATA_LED);
    }
}
#endif

static bool encodeMsmtData(void *data)
{
    if (global_send.handle != 0)
    {
        if (!met_abort)
        {
            emptyQueue(queue);
        }
        NRF_LOG_DEBUG("Not ready for measurement # %lu\r\n", live_data_count);
        return false;
    }
    if (send_flag)
    {
        NRF_LOG_DEBUG("Not ready for measurement at time %lu, still sending\r\n", live_data_count);
        return false;
    }
    return encodeSpecializationMsmts(data);
}

