brianreinhold/NordicPHDs/nRF51/ble_app_met_epoch/main.c
/*
 * For live data I have a timer that triggers a call to this method every MET_LIVE_DELAY.
 * Fake measurements are generated based upon the current time tick in some manner. May not be the
 * greatest approach since the time interval is often a nice even one so one gets the same measurement.
 * That's a minor problem. This is called repeatedly but only generates measurements after the 
 * PHG has given the command to send live data, indicated by 'send_live_data' being true.
 */
static void live_data_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    if (send_live_data && !met_abort)
    {
        live_data_count++;
        NRF_LOG_DEBUG("live data generator called at timestamp32 %lu\r\n", getTicks());
        if (isFull(queue))
        {
            NRF_LOG_DEBUG("Queue full - Not ready for measurement %lu at time %lu\r\n", live_data_count, getTicks());
            return;
        }
        #if (USE_DK == 0)
        {
            if (live_data_count > LIVE_COUNT_MAX)
            {
                NRF_LOG_DEBUG("Sending disconnect\r\n");
                met_abort = false;
                app_timer_start(m_met_disconnect_timer_id, MET_COMMAND_DELAY, NULL);
                app_timer_stop(m_met_live_data_timer_id);
                return;
            }
        }
        #endif
        generateLiveDataForSpecializations(live_data_count, getRtcTicks(), getTicks());
        bsp_board_led_on(MSMT_DATA_LED);
    }
}

static void print_command(char *str)
{
    NRF_LOG_INFO("====> Received %s (%u) command at time %u.\r\n", (uint32_t )str, global_send.current_command, getTicks());
}
/**
  Command handler. This method is called when the PHG writes a command on the MET control point.
 */

static void command_handler(void * p_context)
{
    global_send.chunk_size = (GATT_MTU_SIZE_DEFAULT - OPCODE_LENGTH - HANDLE_LENGTH);
    switch (global_send.current_command)
    {

    case COMMAND_GET_SYS_INFO:
    {
        print_command("Get System Info");
        global_send.chunks_outstanding = 0;
        global_send.data_length = systemInfoData->dataLength;
        global_send.data = systemInfoData->systemInfoBuf;
        global_send.offset = 0;
        global_send.handle = m_met_response_handle.value_handle;
        global_send.continuous_stage = CONT_NONE;
        send_flag = true;
    }
    break;
    
    case COMMAND_GET_CURRENT_TIME:
        print_command("Get Current Time Info");
    #if (USES_TIMESTAMP == 1)
    {
        //char buffer[64];
        getCurrentTime();  // Populates the current time field and prints it
        global_send.chunks_outstanding = 0;
        global_send.data_length = sTimeInfoData->dataLength;
        global_send.data = sTimeInfoData->timeInfoBuf;
        global_send.offset = 0;
        global_send.continuous_stage = CONT_NONE;
        global_send.handle = m_met_response_handle.value_handle;
        //memset(buffer, 0, 64);
        //NRF_LOG_INFO("Created Current Time Info %s at time %u\r\n", 
        //    (uint32_t)byteToHex(sTimeInfoData->timeInfoBuf, buffer, " ", sTimeInfoData->dataLength), getTicks());
        NRF_LOG_FLUSH();
    }
    #else
        createCpResponse(METCP_COMMAND_UNSUPPORTED, NULL);
    #endif
    send_flag = true;
    break;
    
    case COMMAND_SET_CURRENT_TIME:
        print_command("Set Current Time");
        // Set the current time info time sync to synced by PHG
    #if (USES_TIMESTAMP == 1)
        // The update of the CurrentTimeInfo byte array as well as the date time adjustments was done in the event
        createCpResponse(METCP_COMMAND_DONE, NULL);
    #else
        createCpResponse(METCP_COMMAND_UNSUPPORTED, NULL);
    #endif
        send_flag = true;
        break;

    case COMMAND_GET_CONFIG_INFO:
        print_command("Get Config Info");
        createCpResponse(METCP_COMMAND_UNSUPPORTED, NULL);
        send_flag = true;
        break;
    
    case COMMAND_GET_NUMBER_OF_STORED_RECORDS:
        print_command("Get Number of Stored Records");
        #if (USES_STORED_DATA == 1)
            NRF_LOG_INFO("Number of stored records is %u\r\n", numberOfStoredMsmtGroups);
            // Respond with command done
            createCpResponse(METCP_COMMAND_DONE, &numberOfStoredMsmtGroups);
        #else
            createCpResponse(METCP_COMMAND_UNSUPPORTED, NULL);
        #endif
        send_flag = true;
        break;

    case COMMAND_GET_ALL_STORED_RECORDS:
        stored_data_done_sent = false;
        print_command("Get All Stored Records");
        #if (USES_STORED_DATA == 1)
            if (numberOfStoredMsmtGroups > 0)
            {
                NRF_LOG_DEBUG("----> Sending stored data element 0\r\n");
                global_send.number_of_groups = numberOfStoredMsmtGroups;
                sendStoredMeasurements(0);
            }
        #else
            createCpResponse(METCP_COMMAND_UNSUPPORTED, NULL);
            send_flag = true;
        #endif
        break;

    case COMMAND_DELETE_ALL_STORED_RECORDS:
        print_command("Delete All Stored Records");
        #if (USES_STORED_DATA == 1)
            deleteStoredSpecializationMsmts();  // really don't need this, setting numberOfStoredMsmtGroups to 0 will do it.
            numberOfStoredMsmtGroups = 0;
            // Respond with command done
            createCpResponse(METCP_COMMAND_DONE, NULL);
        #else
            createCpResponse(METCP_COMMAND_UNSUPPORTED, NULL);
        #endif
        send_flag = true;
        break;

    case COMMAND_SEND_LIVE_DATA:
        print_command("Send Live Data");
        send_live_data = true;
        break;

    default:
        print_command("an unsupported");
        // Respond with command done
        createCpResponse(METCP_COMMAND_UNKNOWN, NULL);
        send_flag = true;
    }
}

#if (USES_TIMESTAMP == 1)
static void handleSetTime(unsigned char *setTime)
{
    unsigned short i;
    unsigned char oldTime[MET_TIME_LENGTH];
    unsigned char newTime[MET_TIME_LENGTH];
    unsigned long long oldTimeVal = 0;
    unsigned long long newTimeVal = 0;
    long long diff = 0;
    unsigned short timeSync;
    char printBuf[64];
    getCurrentTime();
    memcpy(oldTime, &sTimeInfoData->timeInfoBuf[sTimeInfoData->currentTime_index], MET_TIME_LENGTH); // destination, source, length
    memcpy(newTime, setTime, MET_TIME_LENGTH);
    memset(printBuf, 0, 64);
    NRF_LOG_INFO("Set Time received: %s\r\n", (uint32_t)byteToHex(newTime, printBuf, " ", MET_TIME_LENGTH));
    NRF_LOG_FLUSH();
    updateCurrentTimeFromSetTime(&sTimeInfoData, newTime);
    for (i = 0; i < 6; i++)
    {
         oldTimeVal = (oldTimeVal << 8) + (((unsigned long long)oldTime[5 - i]) & 0xFF);
         newTimeVal = (newTimeVal << 8) + (((unsigned long long)newTime[5 - i]) & 0xFF);
    }
    diff = newTimeVal - oldTimeVal;
//     NRF_LOG_DEBUG("old time in seconds: %d  new time in seconds: %d diff in seconds\r\n", oldTimeVal/1000, newTimeVal/1000, diff/1000);
    epoch = (diff < 0) ? (oldTimeVal - newTimeVal) + epoch : epoch + diff;  // Adjust start epoch by difference too. 
                                                                            // This allows us to get new time by adding current ticks to new start epoch
//     NRF_LOG_DEBUG("New base epoch: %d \r\n", epoch/1000);
    timeSync = (((unsigned short) newTime[MET_TIME_LENGTH - 2]) & 0xFF) + (newTime[MET_TIME_LENGTH -1 ] << 8);
    sMetTime->timeSync = timeSync;      // Update the time sync of our 'base' current time
    // Handles date-time adjustments and updating the time sync in the group data array msmt time stamps
    handleSpecializationsOnSetTime(numberOfStoredMsmtGroups, diff, timeSync);
}
#endif

