brianreinhold/NordicPHDs/nRF51/ble_app_met_epoch/main.c
/*
static bool handleCommonEvents(ble_evt_t* p_ble_evt)
{
    ret_code_t err_code;
    bool used = false;   // just indicates an event was handled when set to true

    switch (p_ble_evt->header.evt_id)
    {
        // From the Dev Zone:
        // 244 bytes is the maximum amount of attribute data that can be sent in a single over the air packet over BLE. The actual data length in this case
        // is 251 bytes, since the ATT protocol adds a 3 byte header and the link layer adds another 4 byte header on top of the attribute data. 
        // The reason the NRF_SDH_BLE_GATT_MAX_MTU_SIZE is set to 247 is to make room for the 3 byte ATT header while still allowing you to send the maximum
        // 244 bytes of attribute data. 

        // According to the Bluetooth specification an attribute can not be larger than 512 bytes (not including the 3 byte header), so if you need to
        // send more data than this you need to split it into multiple packets yourself. 

        // The most efficient way to transmit data over BLE is to split it into 244 byte chunks, since this will utilize the maximum capacity of the
        // BLE packets and minimize the overhead. 
        //
        #if defined (S140)
            case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
                mtu_size = p_ble_evt->evt.gatts_evt.params.exchange_mtu_request.client_rx_mtu;
                NRF_LOG_DEBUG("New MTU size requested %d", mtu_size);
                if (mtu_size > NRF_SDH_BLE_GATT_MAX_MTU_SIZE)   // Set in sdk_config.h
                {
                    mtu_size = NRF_SDH_BLE_GATT_MAX_MTU_SIZE;
                    NRF_LOG_DEBUG("Requested MTU size exceeds maximum; reset to maximum size of %d", mtu_size);
                }
                err_code = sd_ble_gatts_exchange_mtu_reply(p_ble_evt->evt.gatts_evt.conn_handle, mtu_size);

                if (err_code != NRF_SUCCESS)
                {
                    mtu_size = NRF_SDH_BLE_GATT_MAX_MTU_SIZE;
                    NRF_LOG_DEBUG("MTU exchange request reply failed. Error code: 0x%02X", err_code);
                }
                global_send.chunk_size = (mtu_size - OPCODE_LENGTH - HANDLE_LENGTH);
                used = true;
                break;
        #endif

        #if defined (S140) || defined (S113)
            case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:
            {
                ble_gap_data_length_limitation_t limitation;
                ble_gap_data_length_params_t server;
                NRF_LOG_DEBUG("Data length update request: max_rx_octets %d, max_rx_time %d, "
                    "max_tx_octets %d, max_tx_time %d",
                    p_ble_evt->evt.gap_evt.params.data_length_update_request.peer_params.max_rx_octets,
                    p_ble_evt->evt.gap_evt.params.data_length_update_request.peer_params.max_rx_time_us,
                    p_ble_evt->evt.gap_evt.params.data_length_update_request.peer_params.max_tx_octets,
                    p_ble_evt->evt.gap_evt.params.data_length_update_request.peer_params.max_tx_time_us);
                unsigned short tx_size = p_ble_evt->evt.gap_evt.params.data_length_update_request.peer_params.max_rx_octets;
                server.max_rx_octets = p_ble_evt->evt.gap_evt.params.data_length_update_request.peer_params.max_tx_octets;
                server.max_rx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
                server.max_tx_octets = (tx_size < NRF_SDH_BLE_GAP_DATA_LENGTH) ? tx_size : NRF_SDH_BLE_GAP_DATA_LENGTH;  // Set in sdk_config.h
                server.max_tx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
                uint32_t result = sd_ble_gap_data_length_update(p_ble_evt->evt.gap_evt.conn_handle, &server, &limitation);
                NRF_LOG_DEBUG("sd_ble_gap_data_length_update Result %d", result);
                if (result != NRF_SUCCESS)
                {
                    NRF_LOG_DEBUG("RX limit %d  tx limit %d", limitation.rx_payload_limited_octets, limitation.tx_payload_limited_octets);
                }
                used = true;
            }
            break;

            case BLE_GAP_EVT_DATA_LENGTH_UPDATE:
            {
                NRF_LOG_DEBUG("Data length update: max_rx_octets %d, max_rx_time %d, "
                    "max_tx_octets %d, max_tx_time %d",
                    p_ble_evt->evt.gap_evt.params.data_length_update.effective_params.max_rx_octets,
                    p_ble_evt->evt.gap_evt.params.data_length_update.effective_params.max_rx_time_us,
                    p_ble_evt->evt.gap_evt.params.data_length_update.effective_params.max_tx_octets,
                    p_ble_evt->evt.gap_evt.params.data_length_update.effective_params.max_tx_time_us);
                data_length = p_ble_evt->evt.gap_evt.params.data_length_update.effective_params.max_tx_octets;
            }
            used = true;
            break;
        #endif
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            NRF_LOG_DEBUG("Physical update request: rx phys %d, tx phys %d",
                p_ble_evt->evt.gap_evt.params.phy_update_request.peer_preferred_phys.rx_phys,
                p_ble_evt->evt.gap_evt.params.phy_update_request.peer_preferred_phys.tx_phys);
            const ble_gap_phys_t* phys = &p_ble_evt->evt.gap_evt.params.phy_update_request.peer_preferred_phys;
            uint32_t result = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, phys);
            NRF_LOG_DEBUG("Result %d", result);
            used = true;
        }

        case BLE_GAP_EVT_PHY_UPDATE:
        {
            NRF_LOG_DEBUG("Physical update update:rx phys %d, tx phys %d,",
                p_ble_evt->evt.gap_evt.params.phy_update.rx_phy,
                p_ble_evt->evt.gap_evt.params.phy_update.tx_phy);
            used = true;
        }
        break;
    }
    return used;
}
*/

static void handle_response_char_done()
{
    if (global_send.current_command == COMMAND_GET_ALL_STORED_RECORDS ||
        global_send.current_command == COMMAND_SEND_LIVE_DATA)
    {
        if (global_send.continuous_stage == CONT_RECORD_SEND)
        {
            NRF_LOG_DEBUG("----> Send Notification Record done\r\n");
            global_send.continuous_stage = CONT_RECORD_DONE;
            createContinuousRecordDone();
        }
        else if (global_send.continuous_stage == CONT_RECORD_DONE)
        {
            NRF_LOG_DEBUG("----> Notification Record done sent\r\n");
            global_send.handle = 0;
            return;
        }
        else
        {
            NRF_LOG_DEBUG("----> Send Indication Record done\r\n");
            createCpResponse(METCP_COMMAND_RECORD_DONE, NULL);
        }
    }
    else
    {
        createCpResponse(METCP_COMMAND_DONE, NULL);
    }
    send_flag = true;
}

