brianreinhold/NordicPHDs/nRF51/ble_app_met_epoch/main.c
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    uint32_t              err_code;
    ble_gap_conn_params_t connParams;

    if (p_ble_evt == NULL)
    {
        return;
    }

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_INFO("Connection event received at time %u.\r\n", getTicks());
            m_connection_handle = p_ble_evt->evt.gap_evt.conn_handle;
            if (saveDataBuffer != NULL)
            {
                // Calling sd_ble_gatts_sys_attr_set with CCCD info
                err_code = sd_ble_gatts_sys_attr_set(p_ble_evt->evt.gap_evt.conn_handle, saveDataBuffer,
                    saveDataLength, BLE_GATTS_SYS_ATTR_FLAG_SYS_SRVCS | BLE_GATTS_SYS_ATTR_FLAG_USR_SRVCS);
                if (err_code != NRF_SUCCESS)
                {
                    NRF_LOG_DEBUG("Failed updating persistent sys attr info. Error code: 0x%02X\r\n", err_code);
                    free(saveDataBuffer);
                    saveDataBuffer = NULL;
                    saveDataLength = 0;
                }
            }
            #if defined (S140) || defined (S113)
                // Request update of data length
                ble_gap_data_length_limitation_t limitation;
                ble_gap_data_length_params_t server;
                server.max_rx_octets = 27;
                server.max_rx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
                server.max_tx_octets = NRF_SDH_BLE_GAP_DATA_LENGTH; // Set in sdk_config.h
                server.max_tx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
                err_code = sd_ble_gap_data_length_update(p_ble_evt->evt.gap_evt.conn_handle, &server, &limitation);
                NRF_LOG_DEBUG("sd_ble_gap_data_length_update attempt Result %d", err_code);
                if (err_code != NRF_SUCCESS)
                {
                    NRF_LOG_DEBUG("RX limit %d  tx limit %d", limitation.rx_payload_limited_octets, limitation.tx_payload_limited_octets);
                }
            #endif
            bsp_board_led_off(ADVERTISING_LED);
            bsp_board_led_on(CONNECTED_LED);

            break;

        // Service change indication acknolwedged
        case BLE_GATTS_EVT_SC_CONFIRM:
            NRF_LOG_DEBUG("Service change acknowledged at time %u\r\n", getTicks());
            break;

        // Added just for info
        case BLE_GAP_EVT_CONN_PARAM_UPDATE:
            connParams = p_ble_evt->evt.gap_evt.params.conn_param_update.conn_params;
            NRF_LOG_INFO("Connection parameters update at time %u: min: %d max: %d supervision timeout: %d slave latency: %d \r\n",
                getTicks(),
                connParams.min_conn_interval, connParams.max_conn_interval, 
                connParams.conn_sup_timeout, connParams.slave_latency);
            break;
                
            case BLE_GATTC_EVT_TIMEOUT:
            NRF_LOG_INFO("GATT Client Timeout.\r\n");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTC_EVT_TIMEOUT

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            NRF_LOG_INFO("GATT Server Timeout.\r\n");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_TIMEOUT

        case BLE_GAP_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected at time %u\r\n", getTicks());
            app_timer_stop(m_met_live_data_timer_id);
            uint16_t currentSysDataLength;
            unsigned char *currentSysDataBuffer;
            bsp_board_led_off(ADVERTISING_LED);
            bsp_board_led_off(CONNECTED_LED);
            bsp_board_led_off(MSMT_DATA_LED);
            bsp_board_led_on(DISCONNECTED_LED);
            met_abort = true;
      //  NRF_LOG_INFO("Got here 1 at time %u\r\n", getTicks());

            // call twice; once to get the size of the data
            // create the buffer,
            // call a second time to load the data into the buffer
            sd_ble_gatts_sys_attr_get(p_ble_evt->evt.gap_evt.conn_handle, NULL, &currentSysDataLength,
                BLE_GATTS_SYS_ATTR_FLAG_SYS_SRVCS | BLE_GATTS_SYS_ATTR_FLAG_USR_SRVCS);
            // Do we need to upDate flash?
     //   NRF_LOG_INFO("Got here 2 at time %u\r\n", getTicks());
            if (currentSysDataLength > 0) // This should always have something!!
            {
                // Lets get the current system info
                currentSysDataBuffer = calloc(1, currentSysDataLength * sizeof(uint8_t));
                err_code = sd_ble_gatts_sys_attr_get(p_ble_evt->evt.gap_evt.conn_handle, currentSysDataBuffer, &currentSysDataLength,
                    BLE_GATTS_SYS_ATTR_FLAG_SYS_SRVCS | BLE_GATTS_SYS_ATTR_FLAG_USR_SRVCS);
//                NRF_LOG_INFO("Got here 3 at time %u\r\n", getTicks());
                if (err_code != NRF_SUCCESS)
                {
                    NRF_LOG_INFO("Failed getting persistent sys attr info. Error code: 0x%02X\r\n", err_code);
                    // TODO  do something here
                }
                bool isEqual = ((currentSysDataLength == saveDataLength)
                                && (saveDataLength > 0 && saveDataBuffer != NULL)
                                && (memcmp(saveDataBuffer, currentSysDataBuffer, saveDataLength) == 0)
                                && (numberOfStoredMsmtGroups == initialNumberOfStoredMsmtGroups));
                if (isEqual)
                {
                    NRF_LOG_INFO("Flash write not needed; data is equal to what is already in flash\r\n\n\n");
                    
                }
                else
                {
                    if (saveDataBuffer != NULL)
                    {
                        free (saveDataBuffer);
                    }
                    saveDataBuffer = calloc (1, currentSysDataLength *sizeof(uint8_t));
                    saveDataLength = currentSysDataLength;
                    memcpy(saveDataBuffer, currentSysDataBuffer, saveDataLength);
                }
        //        NRF_LOG_INFO("Got here 5 at time %u\r\n", getTicks());
                free(currentSysDataBuffer);
                flash_write_needed = !isEqual;
            }
            m_connection_handle = BLE_CONN_HANDLE_INVALID;
            if (flash_write_needed)
            {
                // this will disable soft device causing app to reset after flash is written
                latestTimeStamp = getRtcTicks();
                saveKeysToFlash(&keys, &saveDataBuffer, &saveDataLength, cccdSet, &noOfCccds);
                initialNumberOfStoredMsmtGroups = numberOfStoredMsmtGroups;
                // Now LEDs wont work - everything is dead due to the sd_softdevice_disable.
                break;
            }
       //     NRF_LOG_INFO("Got here 6  at time %u\r\n", getTicks());
            #if (USE_DK == 0)
                restartAdv = true;
            #endif

            break;

