brianreinhold/NordicPHDs/nRF51/ble_app_met_epoch/main.c
    // Dispatch to the Advertising module last, since it will check if there are any
    // pending flash operations in fstorage. Let fstorage process system events first,
    // so that it can report correctly to the Advertising module.
    // ble_advertising_on_sys_evt(sys_evt);
}
*/

#define RAM_START       0x20000000
static uint32_t ram_end_address_get(void)
{
    uint32_t ram_total_size;

#ifdef NRF51
    uint32_t block_size = NRF_FICR->SIZERAMBLOCKS;
    ram_total_size      = block_size * NRF_FICR->NUMRAMBLOCK;
#else
    ram_total_size      = NRF_FICR->INFO.RAM * 1024;
#endif

    return RAM_START + ram_total_size;
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;

    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

    ble_enable_params_t ble_enable_params;
    err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT,
                                                    PERIPHERAL_LINK_COUNT,
                                                    &ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT, PERIPHERAL_LINK_COUNT);

    // Enable BLE stack.
#if (NRF_SD_BLE_API_VERSION == 3)
    ble_enable_params.gatt_enable_params.att_mtu = NRF_BLE_MAX_MTU_SIZE;
#endif
    err_code = softdevice_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for system events.
    //err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
    //APP_ERROR_CHECK(err_code);
}

// Not sure what this used for
static void gpiote_init_new(void)
{
    APP_GPIOTE_INIT(APP_GPIOTE_MAX_USERS);
}

// This method is called only once after the final measurement is received from the
// sensor module. At this point we start advertising, connect and send the obtained 
// final measurements
static void bring_up_adver(void)
{
    if (m_connection_handle  == BLE_CONN_HANDLE_INVALID)  // Should always be invalid
    {
        emptyQueue(queue);
        // We auto-add a stored msmt when there is no button push
        #if (USE_DK == 0)
            numberOfStoredMsmtGroups = 0;
            generateAndAddStoredMsmt((unsigned long long)getRtcTicks(), getTicks(), numberOfStoredMsmtGroups);
            numberOfStoredMsmtGroups++;
            NRF_LOG_DEBUG("Waiting 4 seconds before restarting advertisments\r\n");
            nrf_delay_ms(4000); // Give us a chance to exit PHG
        #endif
        #if (SPIROMETER == 1)
            spiro_sequence = 0;
        #endif
        #if (SCALE == 1)
            scale_sequence = 0;
        #endif
        msmt_id = 1;
        send_live_data = false;
        live_data_count = 0;
        first_cont_sent = false;
        global_send.continuous_stage = CONT_NONE;
        hasEncrypted = (pairing > 0) ? false : true; // pretend that pairing has been done if we are running not pairable
        met_abort = false;
        flash_write_needed = true;
        bsp_board_led_on(ADVERTISING_LED);
        app_timer_start(m_met_live_data_timer_id, MET_LIVE_DELAY, NULL); // If already running this call does nothing
        advertising_start();
    }
}

/*
static void receive_new_measurement(uint8_t * p_data)
{
    uint8_t     pulse;
    uint8_t     spo;
    unsigned long dev_status;
}
*/

#if (USE_DK == 1)
/*  We only use on the DK in place of no real sensor. To use this code we have to
    bring back the Board Support files into the project. */
    static void bsp_event_handler(bsp_event_t event)
    {

        switch (event)
        {
            case BSP_EVENT_SLEEP:
                break;

            case BSP_EVENT_KEY_3:
            {
                #if (USES_STORED_DATA == 1 && USES_TIMESTAMP == 1)
                    if ( numberOfStoredMsmtGroups >= NUMBER_OF_STORED_MSMTS)
                    {
                        NRF_LOG_DEBUG("Stored data buffer full, skipping\r\n");
                        return;
                    }
                    generateAndAddStoredMsmt(getRtcTicks(), getTicks(), numberOfStoredMsmtGroups);
                    numberOfStoredMsmtGroups++;
                #endif
            }
            break;

            case BSP_EVENT_KEY_1:
                NRF_LOG_INFO("Sending disconnect\r\n");
                met_abort = false;
                app_timer_start(m_met_disconnect_timer_id, GHS_COMMAND_DELAY, NULL);
                break;

            case BSP_EVENT_KEY_2:
            {
                NRF_LOG_INFO("Button press done to start advertising\r\n");
                bring_up_adver();
            }
            break;

            default:
                break;
        }
    }

    static void buttons_leds_init(void)
    {
        bsp_event_t startup_event;

        uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);

        APP_ERROR_CHECK(err_code);

        err_code = bsp_btn_ble_init(NULL, &startup_event);
        APP_ERROR_CHECK(err_code);

}
#else
    /**@brief Function for the LEDs initialization.
     *
     * @details Initializes all LEDs used by the application.
     */
    static void buttons_leds_init(void)
    {
        bsp_board_init(BSP_INIT_LEDS);
    }
#endif

/*
void UART0_IRQHandler_New(app_uart_evt_t * p_app_uart_event)
{
    static uint8_t data_array[7];
    static uint8_t new_data = 0;
    static uint8_t index = 0;
    static bool    is_head_received = false;

    // @snippet [Handling the data received over UART]

    new_data = p_app_uart_event->data.value;
}
*/

/*
static void uart_init(void)
{
    uint32_t err_code;
    const app_uart_comm_params_t comm_params =
      {
          RX_PIN_NUMBER,
          TX_PIN_NUMBER,
          RTS_PIN_NUMBER,
          CTS_PIN_NUMBER,
          APP_UART_FLOW_CONTROL_DISABLED,
          false,        // Use parity
          UART_BAUDRATE_BAUDRATE_Baud115200
      };
    err_code = app_uart_init(&comm_params,
                       NULL,
                       UART0_IRQHandler_New,
                       APP_IRQ_PRIORITY_LOW);

    APP_ERROR_CHECK(err_code);
}
*/
/**@brief Function for the Power manager.
 */
static void initializeBluetooth()
{
    ret_code_t err_code;
    #if (SKIP_FLASH_RELOAD == 0)
    unsigned char cccds[2];

    memset(cccds, 0, noOfCccds);
    loadKeysFromFlash(&keys, &saveDataBuffer, &saveDataLength, cccds, &noOfCccds);
    initialNumberOfStoredMsmtGroups = numberOfStoredMsmtGroups;
    NRF_LOG_DEBUG("Number of saved stored measurements in flash %u\r\n", numberOfStoredMsmtGroups);
    memcpy(cccdSet, cccds, noOfCccds);  // destination, source, length
    
    if (numberOfStoredMsmtGroups > 0)
    {
        NRF_LOG_DEBUG("Factory timer reset: Current tick %u  Saved time of flash write %u\r\n", getRtcTicks(), latestTimeStamp);
        if (getRtcTicks() < latestTimeStamp)  // Time fault - inspect stored data and set flag on different time line
        {
            setNotOnCurrentTimeline(getRtcCount());
        }
    }
    #endif

        // This also provides the callback method to receive events.
    ble_stack_init();
    sd_mutex_new(&p_mutex);
    sd_mutex_new(&q_mutex);

