brianreinhold/NordicPHDs/nRF51/ble_app_met_epoch/main.c
static void main_loop(void)
{
    uint8_t enabled;
    uint16_t len;
    uint32_t result;
    for (;;)
    {
        send_data();        // when flag is set, a set of data is indicated or notified depending upon setup. 
                                // Flag is reset in method
        main_wait();            // Contains the sd_app_evt_wait()
        if (!isEmpty(queue))
        {
            void *data = front(queue);
            if (encodeMsmtData(data))
            {
                NRF_LOG_INFO("Measurement taken from queue\r\n");
                send_flag = true;
                if(sd_mutex_acquire(&q_mutex) != NRF_ERROR_SOC_MUTEX_ALREADY_TAKEN)
                {
                    dequeue(queue);
                    sd_mutex_release(&q_mutex);
                }
            }
        }
        if (restartAdv)     // Only called when USE_DK = 0
        {
            restartAdv = false;
            bsp_board_led_off(DISCONNECTED_LED);
            bsp_board_led_on(MSMT_DATA_LED);
            bring_up_adver();
        }
        while(true)
        {
           // uint32_t evt_id;

            // Don't do this if disabled, for example when writing flash at the end
            sd_softdevice_is_enabled(&enabled); // Don't do this if disabled, for example when writing flash at the end
            if (enabled != 1)
            {
                NRF_LOG_DEBUG("Restarting application at time %lu\r\n", getTicks());
                initializeBluetooth();
                NRF_LOG_DEBUG("Current Epoch time %llu  Current ticks %lu\r\n", (getRtcTicks() + epoch), getTicks());
               // while(NRF_LOG_PROCESS());
               // NRF_POWER->RESETREAS = 0;
               // NVIC_SystemReset();
               // return;
            }
            result = sd_ble_evt_get(NULL, &len);    // Get size of event
            if (result == NRF_ERROR_NOT_FOUND)      // If there aren't any, go back to wait
            {
                break;
            }
            evt_buf = (uint8_t *)calloc(1, len);                // Make space for event. evt_buf is 4-byte aligned
            result = sd_ble_evt_get((uint8_t *)evt_buf, &len);  // get the event
            if (result == NRF_SUCCESS)
            {
                ble_evt_t *evt = (ble_evt_t *)evt_buf;
                ble_evt_dispatch(evt);                          // dispatch event to handler. This handles only BTLE related events
            }
            else                                                // Hopefully no error but just in case log it.
            {                                                   // Should I do an NVIC_SystemReset() here?
                NRF_LOG_INFO("PENDING BLE Event return error: %u\r\n", result);
                free(evt_buf);  // Clean up
                break;          // back to wait
            }
            free(evt_buf);      // clean up and get the next event
        }
    }
}

/**@brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;
    queue = initializeQueue(10);
    if (queue == NULL)
    {
        NRF_LOG_DEBUG("Could not allocate memory for the message queue. Quitting");
        return 0;
    }

    numberOfStoredMsmtGroups = 0;

    // Initialize.
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
    NRF_LOG_INFO("Main start\r\n");

    // Allocate memory for the security keys
    allocateMemoryForSecurityKeys(&keys);
    sec_params_init();
    timers_init();

    memset(&m_met_cp_handle, 0, sizeof(m_met_cp_handle));
    memset(&m_met_response_handle, 0, sizeof(m_met_response_handle));

    buttons_leds_init();

    gpiote_init_new();
    
    configureSpecializations();
    err_code = app_timer_start(m_app_dummy_timer_id, CMD_SENSOR_TIME, NULL);
    APP_ERROR_CHECK(err_code);
    elapsedTimeStart = app_timer_cnt_get();
    #if (USES_TIMESTAMP == 1)
        if (sMetTime->clockType == MET_TIME_FLAGS_RELATIVE_TIME)
        {
           epoch = 0;
        }
        else
        {
            epoch = MET_TIME_EPOCH_DEFAULT;
            epoch = epoch * factor;
        }
        sMetTime->epoch = getRtcTicks() + epoch;
        NRF_LOG_DEBUG("Initial Epoch time %llu\r\n", sMetTime->epoch);
    #endif
    initializeBluetooth();
    
    //=============================================================================== Start GHS Pulse OX
    // Enter main loop.
    main_loop();
    if (saveDataBuffer != NULL)
    {
        free(saveDataBuffer);
    }
    cleanUpQueue(queue);
    cleanUpSpecializations();
}


/**
 * @}
 */
